{
  "id": "TRIZ-13",
  "title": "The Other Way Around (Inversion)",
  "intent": "Solve a problem by reversing actions, relationships, or assumptions instead of optimizing the existing direction.",
  "triz_principle": {
    "number": 13,
    "name": "The Other Way Around",
    "definition": "Invert the action, the system structure, or the problem perspective to achieve the desired effect."
  },
  "problem_understanding": {
    "core_contradiction": "We keep optimizing the current approach, but results do not improve or get worse.",
    "why_this_hurts": "Incremental optimization reinforces a flawed direction; effort increases while impact stays flat.",
    "typical_signals": [
      "repeated optimizations with diminishing returns",
      "more controls but lower throughput",
      "processes that exist mainly to fix problems they create",
      "teams exhausted by constant tuning"
    ]
  },
  "solution_logic": {
    "core_idea": "Reverse the flow, responsibility, or logic instead of refining it.",
    "key_rule": "If improvement stalls, question the direction, not the speed.",
    "how_it_resolves_the_contradiction": "Inversion exposes hidden assumptions and unlocks simpler or more robust solution paths."
  },
  "application_patterns": {
    "consulting": [
      "start from desired outcome and work backwards",
      "replace approval-driven processes with exception-driven ones",
      "shift from pushing work to pulling demand"
    ],
    "software_engineering": [
      "event-driven instead of request-driven architectures",
      "pull-based processing instead of scheduled batch jobs",
      "consumer-controlled retries instead of producer retries"
    ],
    "architecture": [
      "CQRS: queries pull state instead of being updated synchronously",
      "reverse dependencies using dependency inversion",
      "policy-as-code instead of manual enforcement"
    ],
    "enterprise_sap": [
      "exception-based MDG workflows instead of mandatory approvals",
      "downstream-triggered replication instead of central push",
      "derive data on read instead of precomputing everything"
    ]
  },
  "anti_patterns": [
    "inverting without understanding the original goal",
    "creating symmetrical complexity in the opposite direction",
    "mixing old and inverted logic inconsistently"
  ],
  "usage_guidance": {
    "use_when": [
      "optimization no longer yields results",
      "controls keep increasing but quality drops",
      "process exists mainly to manage its own side effects"
    ],
    "do_not_use_when": [
      "current direction is fundamentally correct and under-optimized",
      "inversion would violate safety or compliance constraints"
    ]
  },
  "diagnostic_questions": [
    "What if we did the opposite of our current approach?",
    "Which assumptions would break if flow direction changed?",
    "Who should really control this interaction?"
  ],
  "example": {
    "before": "Central team pushes frequent mandatory updates to all systems.",
    "after": "Systems pull updates when ready, based on explicit contracts and readiness checks."
  }
}