{
  "id": "TRIZ-01",
  "title": "Segmentation",
  "intent": "Reduce system rigidity by dividing a problem into independently changeable parts.",
  "triz_principle": {
    "number": 1,
    "name": "Segmentation",
    "definition": "Divide an object or system into independent parts or make it modular."
  },
  "problem_understanding": {
    "core_contradiction": "The system must be unified to stay controllable, but flexible to evolve and adapt.",
    "why_this_hurts": "When everything is tightly coupled, even small changes require global coordination, slow down delivery, and increase risk.",
    "typical_signals": [
      "large monolithic solutions",
      "every change requires many approvals",
      "teams are afraid to touch core logic",
      "one failure affects many areas"
    ]
  },
  "solution_logic": {
    "core_idea": "Split the problem space into independent segments with clear boundaries.",
    "key_rule": "Segments interact through explicit contracts, not shared internal logic.",
    "how_it_resolves_the_contradiction": "Global consistency is preserved by contracts, while local changes become safe and fast inside segments."
  },
  "application_patterns": {
    "consulting": [
      "split initiatives by decision ownership, not by org structure",
      "separate discovery work from delivery work",
      "define decision domains with explicit escalation rules"
    ],
    "software_engineering": [
      "modularize code by responsibility, not by technical layer",
      "introduce APIs between subsystems",
      "isolate volatile logic behind stable interfaces"
    ],
    "architecture": [
      "bounded contexts instead of one global domain model",
      "anti-corruption layers between systems",
      "independent deployable units"
    ],
    "enterprise_sap": [
      "separate core master data from enrichment attributes",
      "decouple MDG governance from downstream system specifics",
      "use replication contracts instead of shared tables"
    ]
  },
  "anti_patterns": [
    "splitting only organizationally but not technically",
    "creating many segments without clear ownership",
    "shared databases across supposedly independent modules"
  ],
  "usage_guidance": {
    "use_when": [
      "changes are slow and risky",
      "coordination cost is high",
      "system evolution is blocked by fear of breaking things"
    ],
    "do_not_use_when": [
      "the problem is small and stable",
      "overhead of segmentation is higher than the change cost"
    ]
  },
  "example": {
    "before": "One central system handles validation, enrichment, governance, and distribution logic.",
    "after": "Core validation is isolated, enrichment rules are segmented, and distribution is handled via explicit interfaces."
  }
}