{
  "id": "TRIZ-TECH-02",
  "title": "Physical Contradiction + Separation Principles",
  "intent": "Break a deadlock where the same parameter must be simultaneously high and low by separating requirements across conditions.",
  "technique": {
    "name": "Physical Contradiction",
    "definition": "One and the same parameter must have opposite values to satisfy different requirements."
  },
  "inputs": {
    "object_or_variable": "The thing that must be both A and not-A (e.g., 'validation strictness', 'release speed').",
    "requirement_A": "Why it must be high/strong/fast/etc.",
    "requirement_not_A": "Why it must be low/weak/slow/etc."
  },
  "procedure": [
    "Convert engineering contradiction into physical form: '<variable> must be HIGH to achieve..., and LOW to avoid...'.",
    "Choose a separation axis:",
    "  - Separation in time: high now, low later (or vice versa).",
    "  - Separation in space: high in one area, low in another.",
    "  - Separation on condition: high only under specific triggers/risk levels.",
    "  - Separation between whole and parts: strict globally, flexible locally (or reverse).",
    "Design a mechanism that enforces the separation (rules, routing, architecture boundary, workflow branching)."
  ],
  "outputs": {
    "physical_contradiction": "<variable> must be HIGH and LOW.",
    "separation_strategy": "time | space | condition | whole_vs_parts",
    "solution_candidates": [
      "branching workflow by risk",
      "strict validation at boundary, flexible internally",
      "fast path + slow path"
    ]
  },
  "common_mistakes": [
    "Trying to compromise (medium value) instead of separating",
    "Choosing a separation axis but not implementing an enforcement mechanism",
    "Applying separation everywhere instead of only where the contradiction lives"
  ],
  "example": {
    "enterprise": {
      "physical_contradiction": "Master data validation must be strict (to prevent financial errors) and flexible (to avoid blocking operations).",
      "separation_on_condition": "Strict rules for high-risk attributes; relaxed rules for low-risk attributes with monitoring."
    },
    "software": {
      "physical_contradiction": "Release process must be fast and slow.",
      "separation_in_time": "Fast canary releases first; full verification and rollout later."
    }
  }
}