{
  "id": "TRIZ-06",
  "title": "Universality",
  "intent": "Reduce system complexity by making one element perform multiple functions instead of introducing new specialized components.",
  "triz_principle": {
    "number": 6,
    "name": "Universality",
    "definition": "Make an object or system perform multiple functions, eliminating the need for other parts."
  },
  "problem_understanding": {
    "core_contradiction": "We want richer functionality, but adding new components increases complexity, cost, and maintenance burden.",
    "why_this_hurts": "Each new specialized element adds integration points, failure modes, documentation, and cognitive load for teams.",
    "typical_signals": [
      "many small tools doing similar things",
      "overlapping services or frameworks",
      "high integration and maintenance cost",
      "teams struggling to understand the full landscape"
    ]
  },
  "solution_logic": {
    "core_idea": "Reuse and extend existing elements to cover multiple related needs.",
    "key_rule": "Prefer extending a stable, well-understood component over introducing a new specialized one.",
    "how_it_resolves_the_contradiction": "Functionality grows while the number of moving parts stays limited, reducing coordination and operational risk."
  },
  "application_patterns": {
    "consulting": [
      "use one decision forum to handle related topics instead of many committees",
      "define roles that cover multiple adjacent responsibilities",
      "reuse a single framework for analysis, design, and evaluation"
    ],
    "software_engineering": [
      "reuse a common pipeline for validation, transformation, and logging",
      "extend existing services with configuration instead of new microservices",
      "use shared libraries instead of duplicating logic"
    ],
    "architecture": [
      "platform components providing multiple capabilities (auth, audit, config)",
      "shared event backbone instead of point-to-point integrations",
      "common domain services reused across contexts"
    ],
    "enterprise_sap": [
      "use MDG as a single governance entry point for multiple master data objects",
      "reuse BRF+ rules across validation, derivation, and decision logic",
      "leverage standard SAP frameworks instead of parallel custom tools"
    ]
  },
  "anti_patterns": [
    "overloading a component beyond its natural responsibility",
    "creating a god object that knows too much",
    "forcing universality where specialization is required"
  ],
  "usage_guidance": {
    "use_when": [
      "multiple components solve closely related problems",
      "integration and maintenance costs dominate",
      "a stable core component already exists"
    ],
    "do_not_use_when": [
      "responsibilities are fundamentally different",
      "scaling or performance needs diverge strongly",
      "the component would become a single point of failure"
    ]
  },
  "diagnostic_questions": [
    "Which tools or services overlap in purpose?",
    "What functionality could be absorbed by an existing stable component?",
    "Where does adding a new component create more cost than value?"
  ],
  "example": {
    "before": "Separate services handle validation, auditing, and routing, each with its own configuration and lifecycle.",
    "after": "A single configurable pipeline performs validation, auditing, and routing based on context."
  }
}