{
  "id": "TRIZ-36",
  "title": "Phase Transitions",
  "intent": "Achieve step-change improvements by moving the system into a different operating state instead of incremental optimization.",
  "triz_principle": {
    "number": 36,
    "name": "Phase Transitions",
    "definition": "Use phase changes (state transitions) to obtain new properties or behavior."
  },
  "problem_understanding": {
    "core_contradiction": "Incremental improvements are not enough, but radical redesign seems too risky.",
    "why_this_hurts": "Teams keep polishing within the same mode of operation, hitting a ceiling where effort no longer translates into results.",
    "typical_signals": [
      "diminishing returns from optimization",
      "systems behaving well until a sudden collapse",
      "processes that fail only beyond certain scale or volume",
      "performance cliffs instead of smooth degradation"
    ]
  },
  "solution_logic": {
    "core_idea": "Change the operating state of the system so new properties emerge.",
    "key_rule": "Do not optimize inside a phase that has reached its limits.",
    "how_it_resolves_the_contradiction": "A phase change unlocks fundamentally different behavior instead of marginal gains."
  },
  "application_patterns": {
    "consulting": [
      "switch from project mode to product mode",
      "move from manual decision-making to rule-based governance",
      "introduce outcome-based funding instead of activity-based budgeting"
    ],
    "software_engineering": [
      "switch from synchronous to asynchronous processing",
      "move from monolith to modular monolith",
      "introduce streaming instead of batch at scale thresholds"
    ],
    "architecture": [
      "event-driven transition after scale threshold",
      "read/write separation when contention appears",
      "introduce eventual consistency instead of strict ACID everywhere"
    ],
    "enterprise_sap": [
      "move from manual master data maintenance to MDG",
      "switch from project-specific rules to reusable governance frameworks",
      "transition from migration mode to steady-state governance"
    ]
  },
  "anti_patterns": [
    "triggering phase change too early",
    "mixing phases without clear boundaries",
    "ignoring readiness for the new state"
  ],
  "usage_guidance": {
    "use_when": [
      "incremental optimization no longer works",
      "system behavior changes abruptly at scale",
      "constraints are inherent to the current mode"
    ],
    "do_not_use_when": [
      "problem can still be solved by tuning parameters",
      "organization is not ready for a new operating model"
    ]
  },
  "diagnostic_questions": [
    "What mode is the system currently operating in?",
    "Where do we see sharp behavioral changes?",
    "What new properties would a different mode unlock?"
  ],
  "example": {
    "before": "Manual master data processes struggle as volume grows.",
    "after": "MDG introduces a new governance phase with automated workflows and rules."
  }
}